{
    "DynamicJS": {
        "Settings": "DynamicJS Settings",
        "Description": "DynamicJS let the provider of Piwik service, converts given url to site id and custom Javascript which can be loaded by the website.",
        "BackendSettings": "Backend Settings",
        "DefaultBackend": "Default Backend",
        "DefaultBackendDesc": "The default backend that should be used to find the siteId. When Nothing set, the PiwikBackend is used",
        "DefaultEmail": "Default Email",
        "DefaultEmailDesc": "When user does not have an email address this email address is used",
        "AcceptedDomains": "Accepted Domains",
        "GeneralSettings": "General Settings",
        "BackendPaths": "Backend Paths",
        "BackendPathsDesc": "The path of the folders that contains the backends. This should be added in comma separated values",
        "AcceptedDomainsDesc": "Domains that the server should react to. It is done to avoid DDOS and limit the responses the server makes. Use comma separated values",
        "RecursionLevel": "Recursion Level",
        "RecursionLevelDesc": "How deep should the path be checked for existing site id. The default value is 1.",
        "EnableCache": "Enable Caching",
        "EnableCacheDesc": "Should website information be cached used. This uses standard Piwik caching settings. This should not be disabled most of the time, for performance reason.",
        "CacheSetting": "Cache Setting",
        "FlushCache": "Flush Cache",
        "FlushCacheDesc": "Flushes the given cache, we use the lazy backend so everything there will be flushed",
        "FlushCacheSuccess": "Cache Flushes Successfully",
        "EnableMultiLang": "Enables MultiLang Support",
        "EnableMultiLangDesc": "Enables Matching which have locale in the path like /en/... or /de/",
        "MultiLangRegex": "Regex for Matching Locale",
        "MultiLangRegexDesc": "The regex that should be used to match multi language paths. defaults /[a-z][a-z]\//",
        "RemoveCache": "Remove Cache",
        "ScriptTemplate": "Script Template",
        "ScriptTemplateDesc": "Script template allows you to customize the end result of this extension, the site id found will be added in the placeholder variable  {{siteId}}.",
        "RemoveCacheDesc": "When a new site is added. The cache is automatically deleted. You can also delete the cache manually with the button.",
        "EnableAddHost": "Enable Add Host",
        "EnableAddHostDesc": "With this piwik using different backend than it self, will add the host as a new site id if it exists in the other backend. <b> Only usable when other backend than PiwikBackend is used.</b>",
        "EnableAddUser": "Enable Add User",
        "EnableAddUserDesc": "Adds a new user to piwik that has access to the given existing or new host, when other backend than piwik is used. <b> Only usable when other backend than PiwikBackend is used. </b>",
        "EnableNoScript": "Enable No Script",
        "EnableNoScriptDesc": "This will make the server response with a site id, extracted from referrer url and redirect the user to this site id. This can be useful for the client that does not support javascript.",
        "DefaultAccess": "Default Access",
        "DefaultAccessDesc": "Default access to the given user for the new or existing site. It is view when not changed. Works if AddUser and AddHost are enabled.",
        "LdapHost": "Ldap Host",
        "LdapHostDesc": "The ip address or hostname of the Ldap server",
        "LdapPort": "Ldap Port",
        "LdapPortDesc": "The port that the Ldap server listens to",
        "LdapEncryption": "Ldap Encryption",
        "LdapEncryptionDesc": "The encryption used with the Ldap server. Can be none, tls or ssl. Use ssl when you have ldaps server.",
        "LdapDN": "Ldap DN",
        "LdapDNDesc": "Ldap Distinguished Name, to be used for faster search in Ldap server",
        "LdapFilter": "Ldap Filter",
        "LdapFilterDesc": "Filter that should be used to search the Ldap server. The filter can have two variables {{domain}} and {{ path }}. <br>Example: <pre>(&amp;(HostTarget=typo3)(HostDomain={{ domain }})(HostPath={{ path }}))</pre>",
        "LdapUserName": "Ldap Bind Username",
        "LdapUserNameDesc": "The username that should be used to bind to the Ldap server",
        "LdapPassword": "Ldap Bind Password",
        "LdapPasswordDesc": "The password used for LDAP binding",
        "LdapUsernameKey": "Ldap Username key",
        "LdapUsernameKeyDesc": "This is used to find the username in the results from Ldap server. Normally 'manager' would be the key",
        "LdapUsernameRegex": "Ldap Username Regex",
        "LdapUsernameRegexDesc": "The regex which is used to find the username in the username string.<br> Example: <pre>/cn=(?&lt;username&gt;[0-9A-Z-a-z]+)/</pre>",
        "LdapUsernameRegexMatchKey": "Ldap Username Matching Key",
        "LdapUsernameRegexMatchKeyDesc": "The key for the matching used in the regex. In the example it is username",
        "LdapUsernameInfoEmailKey": "Ldap Email Key",
        "LdapUsernameInfoEmailKeyDesc": "The key that should be used to find email in LDAP results",
        "LdapUsernameInfoAliasKey": "Ldap Alias Key",
        "LdapUsernameInfoAliasKeyDesc": "The key that should be usd to find alias in LDAP results",
        "LdapUsernameInfoUsernameKeyDesc": "The key that should be used to find a username in LDAP results",
        "LdapUsernameInfoUsernameKey": "Ldap Username Key",
        "LdapUsernameInfoDnDesc": "The DN that should be used for LDAP user information search",
        "LdapUsernameInfoDn": "LDAP DN for User Info",
        "LdapUsernameInfoFilter": "Ldap User Info Filter",
        "LdapUsernameInfoFilterDesc": "The filter that should be used to find user"
    }
}